Revit 2027 API
BuiltInFailures.LinkFailures.DataDictionaryDifferentInLink Property
 Linked file [Name] was last saved in a previous version of Revit. Changes to it cannot be saved until it is upgraded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DataDictionaryDifferentInLink { get; }
Public Shared ReadOnly Property DataDictionaryDifferentInLink As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DataDictionaryDifferentInLink {
	FailureDefinitionId^ get ();
}
static member DataDictionaryDifferentInLink : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LinkFailures Class
Autodesk.Revit.DB Namespace